Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Custom quality checks, add-ons, automatic suggestions and auto-fixes
sv: Anpassade kvalitetskontroller, tillÃ¤gg, automatiska fÃ¶rslag och automatiska korrigeringar

source: To install your code for :ref:`custom-autofix`, :ref:`own-checks`, :ref:`custom-machinery` or :ref:`own-addon` in Weblate:
sv: FÃ¶r att installera din kod fÃ¶r :ref:`custom-autofix`, :ref:`own-checks`, :ref:`custom-machinery` eller :ref:`own-addon` i Weblate:

source: Place the files into your Python module containing the Weblate customization (see :ref:`custom-module` or :ref:`docker-python-override`).
sv: Placera filerna i din Python-modul som innehÃ¥ller Weblate-anpassningen (se :ref:`custom-module` eller :ref:`docker-python-override`).

source: Add its fully-qualified path to the Python class in the dedicated settings:
sv: LÃ¤gg till dess fullstÃ¤ndiga sÃ¶kvÃ¤g till Python-klassen i de dedikerade instÃ¤llningarna:

source: Weblate deployments
sv: Weblate-distributioner

source: Weblate can be easily installed in your cloud. Please find detailed guide for your platform:
sv: Weblate kan enkelt installeras i ditt moln. HÃ¤r hittar du en detaljerad guide fÃ¶r din plattform:

source: Third-party deployments for Weblate
sv: Tredjepartsdistributioner fÃ¶r Weblate

source: Following deployments are not developed or supported by Weblate team. Parts of the setup might vary from what is described in this documentation.
sv: FÃ¶ljande installationer Ã¤r inte utvecklade eller stÃ¶ds av Weblate-teamet. Delar av installationen kan skilja sig frÃ¥n vad som beskrivs i denna dokumentation.

source: Weblate Cloudron Package
sv: Weblate Cloudron-paket

source: `Cloudron <https://www.cloudron.io/>`_ is a platform for self-hosting web applications. Weblate installed with Cloudron will be automatically kept up-to-date. The package is maintained by the Cloudron team at their `Weblate package repo <https://git.cloudron.io/cloudron/weblate-app>`_.
sv: `Cloudron <https://www.cloudron.io/>`_ Ã¤r en plattform fÃ¶r sjÃ¤lvhostade webbapplikationer. Weblate som installeras med Cloudron uppdateras automatiskt. Paketet underhÃ¥lls av Cloudron-teamet i deras `Weblate-paketrepo <https://git.cloudron.io/cloudron/weblate-app>`_.

source: Install Weblate with Cloudron
sv: Installera Weblate med Cloudron

source: Weblate in YunoHost
sv: Weblate i YunoHost

source: The self-hosting project `YunoHost <https://yunohost.org/>`_ provides a package for Weblate. Once you have your YunoHost installation, you may install Weblate as any other application. It will provide you with a fully working stack with backup and restoration, but you may still have to edit your settings file for specific usages.
sv: Det sjÃ¤lvhostade projektet `YunoHost <https://yunohost.org/>`_ tillhandahÃ¥ller ett paket fÃ¶r Weblate. NÃ¤r du har installerat YunoHost kan du installera Weblate som vilken annan applikation som helst. Det ger dig en fullt fungerande stack med sÃ¤kerhetskopiering och Ã¥terstÃ¤llning, men du kan fortfarande behÃ¶va redigera din instÃ¤llningsfil fÃ¶r specifika anvÃ¤ndningsomrÃ¥den.

source: You may use your administration interface, or this button (it will bring you to your server):
sv: Du kan anvÃ¤nda ditt administrationsgrÃ¤nssnitt eller den hÃ¤r knappen (den tar dig till din server):

source: Install Weblate with YunoHost
sv: Installera Weblate med YunoHost

source: It also is possible to use the command-line interface:
sv: Det Ã¤r ocksÃ¥ mÃ¶jligt att anvÃ¤nda kommandoradsgrÃ¤nssnittet:

source: Quick setup guide
sv: Snabbinstallationsguide

source: Configuration instructions
sv: Konfigurationsinstruktioner

source: Installing Weblate
sv: Installera Weblate

source: Depending on your setup and experience, choose an appropriate installation method for you:
sv: VÃ¤lj en lÃ¤mplig installationsmetod utifrÃ¥n din konfiguration och erfarenhet:

source: :doc:`install/docker`, recommended for production setups.
sv: :doc:`install/docker`, rekommenderas fÃ¶r produktionsmiljÃ¶er.

source: Virtualenv installation, recommended for production setups:
sv: Virtualenv-installation, rekommenderas fÃ¶r produktionsmiljÃ¶er:

source: :doc:`install/source`, recommended for development.
sv: :doc:`install/source`, rekommenderas fÃ¶r utveckling.

source: Architecture overview
sv: ArkitekturÃ¶versikt

source: Handling incoming HTTP requests, :ref:`static-files`.
sv: Hantera inkommande HTTP-fÃ¶rfrÃ¥gningar, :ref:`static-files`.

source: Celery workers
sv: Selleriarbetare

source: :ref:`celery` are executed here.
sv: :ref:`celery` exekveras hÃ¤r.

source: Depending on your workload, you might want to customize the number of workers.
sv: Beroende pÃ¥ din arbetsbelastning kan du behÃ¶va anpassa antalet arbetare.

source: Use dedicated node when scaling Weblate horizontally.
sv: AnvÃ¤nd dedikerad nod vid horisontell skalning av Weblate.

source: A WSGI server serving web pages to users.
sv: En WSGI-server som levererar webbsidor till anvÃ¤ndare.

source: PostgreSQL database server for storing all the content, see :ref:`database-setup`.
sv: PostgreSQL-databasserver fÃ¶r lagring av allt innehÃ¥ll, se :ref:`database-setup`.

source: Use dedicated database node for sites with hundreds of millions of hosted words.
sv: AnvÃ¤nd dedikerad databasnod fÃ¶r webbplatser med hundratals miljoner vÃ¤rdord.

source: Key/value datastore such as Valkey or Redis server for cache and tasks queue, see :ref:`celery`.
sv: Nyckel/vÃ¤rde-databas sÃ¥som Valkey eller Redis-server fÃ¶r cache och uppgiftskÃ¶, se :ref:`celery`.

source: File system
sv: Filsystem

source: File system storage for storing VCS repositories and uploaded user data. This is shared by all the processes.
sv: Filsystemlagring fÃ¶r lagring av VCS-arkiv och uppladdade anvÃ¤ndardata. Detta delas av alla processer.

source: Use networked storage when scaling Weblate horizontally.
sv: AnvÃ¤nd nÃ¤tverkslagring nÃ¤r du skalar Weblate horisontellt.

source: E-mail server
sv: E-postserver

source: SMTP server for outgoing e-mail, see :ref:`out-mail`. It can be provided externally.
sv: SMTP-server fÃ¶r utgÃ¥ende e-post, se :ref:`out-mail`. Den kan tillhandahÃ¥llas externt.

source: :doc:`/admin/install/docker` includes PostgreSQL and Valkey, making the installation easier.
sv: :doc:`/admin/install/docker` innehÃ¥ller PostgreSQL och Valkey, vilket underlÃ¤ttar installationen.

source: Software requirements
sv: Programvarukrav

source: Operating system
sv: Operativsystem

source: Weblate is known to work on Linux, FreeBSD and macOS. Other Unix like systems will most likely work too.
sv: Weblate fungerar pÃ¥ Linux, FreeBSD och macOS. Andra Unix-liknande system kommer troligen ocksÃ¥ att fungera.

source: Weblate is not supported on Windows. But it may still work and patches are happily accepted.
sv: Weblate stÃ¶ds inte pÃ¥ Windows. Men det kan fortfarande fungera och patchar tas gÃ¤rna emot.

source: :ref:`architecture` describes overall Weblate architecture and required services.
sv: :ref:`architecture` beskriver Weblates Ã¶vergripande arkitektur och nÃ¶dvÃ¤ndiga tjÃ¤nster.

source: Python dependencies
sv: Python-beroenden

source: Weblate is written in `Python <https://www.python.org/>`_ and supports Python 3.12 or newer. You can install dependencies using pip or from your distribution packages, full list is available in :file:`requirements.txt`.
sv: Weblate Ã¤r skrivet i `Python <https://www.python.org/>`_ och stÃ¶der Python 3.12 eller nyare. Du kan installera beroenden med pip eller frÃ¥n dina distributionspaket. En fullstÃ¤ndig lista finns i :file:`requirements.txt`.

source: Most notable dependencies:
sv: De mest anmÃ¤rkningsvÃ¤rda beroendena:

source: Optional dependency specifier
sv: Valfri beroendespecifikator

source: Python packages
sv: Python-paket

source: Weblate feature
sv: Weblate-funktion

source: :ref:`mt-google-translate-api-v3` with glossary support
sv: :ref:`mt-google-translate-api-v3` med stÃ¶d fÃ¶r ordlista

source: MySQL or MariaDB, see :ref:`database-setup`
sv: MySQL eller MariaDB, se :ref:`database-setup`

source: PostgreSQL, see :ref:`database-setup`
sv: PostgreSQL, se :ref:`database-setup`

source: Integrating SAML 2 IDP into Weblate
sv: Integrera SAML 2 IDP i Weblate

source: Hosted Weblate integration
sv: Hostad Weblate-integration

source: wsgi server for Weblate
sv: wsgi-server fÃ¶r Weblate

source: When installing using pip, you can directly specify desired features when installing:
sv: NÃ¤r du installerar med pip kan du direkt ange Ã¶nskade funktioner vid installationen:

source: Or you can install Weblate with all optional features:
sv: Eller sÃ¥ kan du installera Weblate med alla valfria funktioner:

source: Or you can install Weblate without any optional features:
sv: Eller sÃ¥ kan du installera Weblate utan nÃ¥gra valfria funktioner:

source: Troubleshooting pip install
sv: FelsÃ¶kning av pip-installation

source: The installed ``PyGobject`` package cannot find a matching GObject Introspection library - ``gobject-introspection-2.0``.
sv: Det installerade paketet ``PyGobject`` kan inte hitta ett matchande GObject Introspection-bibliotek - ``gobject-introspection-2.0``.

source: Older versions are no longer supported by Weblate.
sv: Ãldre versioner stÃ¶ds inte lÃ¤ngre av Weblate.

source: This is caused by incompatibility of binary packages distributed via PyPI with the distribution. To address this, you need to rebuild the package on your system:
sv: Detta beror pÃ¥ att binÃ¤rpaket som distribueras via PyPI Ã¤r inkompatibla med distributionen. FÃ¶r att lÃ¶sa detta mÃ¥ste du bygga om paketet pÃ¥ ditt system:

source: This is a known issue of the xmlsec package, please see https://github.com/xmlsec/python-xmlsec/issues/314.
sv: Detta Ã¤r ett kÃ¤nt problem med xmlsec-paketet, se https://github.com/xmlsec/python-xmlsec/issues/314.

source: The ``lxml`` and ``xmlsec`` packages have to be built against one ``libxml2``. You should build them locally to avoid this issue:
sv: Paketen ``lxml`` och ``xmlsec`` mÃ¥ste byggas mot en ``libxml2``. Du bÃ¶r bygga dem lokalt fÃ¶r att undvika detta problem:

source: Other system requirements
sv: Ãvriga systemkrav

source: The following dependencies have to be installed on the system:
sv: FÃ¶ljande beroenden mÃ¥ste installeras pÃ¥ systemet:

source: Pango, Cairo and related header files and GObject introspection data
sv: Pango, Cairo och relaterade huvudfiler samt GObject-introspektionsdata

source: https://cairographics.org/, https://www.gtk.org/docs/architecture/pango, see :ref:`pangocairo`
sv: https://cairographics.org/, https://www.gtk.org/docs/architecture/pango, se :ref:`pangocairo`

source: ``git-review`` (optional for Gerrit support)
sv: ``git-review`` (valfritt fÃ¶r Gerrit-stÃ¶d)

source: ``git-svn`` (optional for Subversion support)
sv: ``git-svn`` (valfritt fÃ¶r Subversion-stÃ¶d)

source: ``tesseract`` (needed only if :program:`tesserocr` binary wheels are not available for your system)
sv: ``tesseract`` (krÃ¤vs endast om :program:`tesserocr` binÃ¤ra hjul inte Ã¤r tillgÃ¤ngliga fÃ¶r ditt system)

source: Build-time dependencies
sv: Beroenden vid byggtiden

source: To build some of the :ref:`python-deps` you might need to install their dependencies. This depends on how you install them, so please consult individual packages for documentation. You won't need those if using prebuilt ``Wheels`` while installing using ``pip`` or when you use distribution packages.
sv: FÃ¶r att bygga vissa av :ref:`python-deps` kan du behÃ¶va installera deras beroenden. Detta beror pÃ¥ hur du installerar dem, sÃ¥ se dokumentationen fÃ¶r de enskilda paketen. Du behÃ¶ver inte dessa om du anvÃ¤nder fÃ¶rkompilerade ``Wheels`` nÃ¤r du installerar med ``pip`` eller nÃ¤r du anvÃ¤nder distributionspaket.

source: Pango and Cairo
sv: Pango och Kairo

source: Weblate uses Pango and Cairo for rendering bitmap widgets (see :ref:`promotion`) and rendering checks (see :ref:`fonts`). To properly install Python bindings for those you need to install system libraries first - you need both Cairo and Pango, which in turn need GLib. All those should be installed with development files and GObject introspection data.
sv: Weblate anvÃ¤nder Pango och Cairo fÃ¶r att rendera bitmap-widgets (se :ref:`promotion`) och rendera kontroller (se :ref:`fonts`). FÃ¶r att korrekt installera Python-bindningar fÃ¶r dessa mÃ¥ste du fÃ¶rst installera systembibliotek â du behÃ¶ver bÃ¥de Cairo och Pango, som i sin tur behÃ¶ver GLib. Alla dessa bÃ¶r installeras med utvecklingsfiler och GObject-introspektionsdata.

source: Hardware requirements
sv: HÃ¥rdvarukrav

source: Weblate should run on any contemporary hardware without problems, the following is the minimal configuration required to run Weblate on a single host (Weblate, database and web server):
sv: Weblate bÃ¶r fungera utan problem pÃ¥ all modern hÃ¥rdvara. Nedan anges den minimikonfiguration som krÃ¤vs fÃ¶r att kÃ¶ra Weblate pÃ¥ en enda vÃ¤rd (Weblate, databas och webbserver):

source: 3 GB of RAM
sv: 3 GB RAM-minne

source: 2 CPU cores
sv: 2 CPU-kÃ¤rnor

source: 1 GB of storage space
sv: 1 GB lagringsutrymme

source: Actual requirements for your installation of Weblate vary heavily based on the size of the translations managed in it.
sv: De faktiska kraven fÃ¶r din installation av Weblate varierar kraftigt beroende pÃ¥ storleken pÃ¥ de Ã¶versÃ¤ttningar som hanteras i den.

source: Memory usage
sv: AnvÃ¤nt minne

source: The more memory the better - it is used for caching on all levels (file system, database and Weblate). For hundreds of translation components, at least 4 GB of RAM is recommended.
sv: Ju mer minne desto bÃ¤ttre â det anvÃ¤nds fÃ¶r caching pÃ¥ alla nivÃ¥er (filsystem, databas och Weblate). FÃ¶r hundratals Ã¶versÃ¤ttningskomponenter rekommenderas minst 4 GB RAM-minne.

source: For systems with less memory than recommended, :ref:`minimal-celery` is recommended.
sv: FÃ¶r system med mindre minne Ã¤n rekommenderat rekommenderas :ref:`minimal-celery`.

source: CPU usage
sv: CPU-anvÃ¤ndning

source: Many concurrent users increase the amount of needed CPU cores.
sv: MÃ¥nga samtidiga anvÃ¤ndare Ã¶kar behovet av CPU-kÃ¤rnor.

source: Storage usage
sv: Lagringsutnyttjande

source: The typical database storage usage is around 300 MB per 1 million hosted words.
sv: Den typiska databaslagringsanvÃ¤ndningen Ã¤r cirka 300 MB per 1 miljon lagrade ord.

source: Storage space needed for cloned repositories varies, but Weblate tries to keep their size minimal by doing shallow clones.
sv: Lagringsutrymmet som behÃ¶vs fÃ¶r klonade arkiv varierar, men Weblate fÃ¶rsÃ¶ker hÃ¥lla storleken minimal genom att gÃ¶ra ytliga kloner.

source: Nodes
sv: Noder

source: For small and medium-sized sites (millions of hosted words), all Weblate components (see :ref:`architecture`) can be run on a single node.
sv: FÃ¶r smÃ¥ och medelstora webbplatser (miljoner vÃ¤rdord) kan alla Weblate-komponenter (se :ref:`architecture`) kÃ¶ras pÃ¥ en enda nod.

source: When you grow to hundreds of millions of hosted words, it is recommended to have a dedicated node for database (see :ref:`database-setup`).
sv: NÃ¤r du vÃ¤xer till hundratals miljoner lagrade ord rekommenderas det att ha en dedikerad nod fÃ¶r databasen (se :ref:`database-setup`).

source: Verifying release signatures
sv: Verifiera signaturer fÃ¶r utgivningar

source: Weblate release are cryptographically signed using `Sigstore signatures <https://www.sigstore.dev/>`_. The signatures are attached to the GitHub release.
sv: Weblate-utgÃ¥vor Ã¤r kryptografiskt signerade med `Sigstore-signaturer <https://www.sigstore.dev/>`_. Signaturerna bifogas GitHub-utgÃ¥van.

source: The verification can be performed using `sigstore package <https://pypi.org/project/sigstore/>`_. The following example verifies signature of the 5.4 release:
sv: Verifieringen kan utfÃ¶ras med hjÃ¤lp av `sigstore package <https://pypi.org/project/sigstore/>`_. FÃ¶ljande exempel verifierar signaturen fÃ¶r version 5.4:

source: Filesystem permissions
sv: Filssystemets behÃ¶righeter

source: The Weblate process needs to be able to read and write to the directory where it keeps data - :setting:`DATA_DIR`. All files within this directory should be owned and writable by the user running all Weblate processes (typically WSGI and Celery, see :ref:`server` and :ref:`celery`).
sv: Weblate-processen mÃ¥ste kunna lÃ¤sa och skriva till den katalog dÃ¤r den lagrar data - :setting:`DATA_DIR`. Alla filer i denna katalog ska Ã¤gas av och vara skrivbara fÃ¶r den anvÃ¤ndare som kÃ¶r alla Weblate-processer (vanligtvis WSGI och Celery, se :ref:`server` och :ref:`celery`).

source: The default configuration places them in the same tree as the Weblate sources, however you might prefer to move these to a better location such as: :file:`/var/lib/weblate`.
sv: Standardkonfigurationen placerar dem i samma trÃ¤d som Weblate-kÃ¤llorna, men du kanske fÃ¶redrar att flytta dem till en bÃ¤ttre plats, till exempel: :file:`/var/lib/weblate`.

source: Weblate tries to create these directories automatically, but it will fail when it does not have permissions to do so.
sv: Weblate fÃ¶rsÃ¶ker skapa dessa kataloger automatiskt, men det misslyckas om det inte har behÃ¶righet att gÃ¶ra det.

source: You should also take care when running :ref:`manage`, as they should be ran under the same user as Weblate itself is running, otherwise permissions on some files might be wrong.
sv: Du bÃ¶r ocksÃ¥ vara fÃ¶rsiktig nÃ¤r du kÃ¶r :ref:`manage`, eftersom det bÃ¶r kÃ¶ras under samma anvÃ¤ndare som Weblate sjÃ¤lv kÃ¶rs under, annars kan behÃ¶righeterna fÃ¶r vissa filer bli felaktiga.

source: In the Docker container, all files in the :file:`/app/data` volume have to be owned by the ``weblate`` user inside the container (UID 1000).
sv: I Docker-containern mÃ¥ste alla filer i volymen :file:`/app/data` Ã¤gas av anvÃ¤ndaren ``weblate`` i containern (UID 1000).

source: Database setup for Weblate
sv: DatabasinstÃ¤llningar fÃ¶r Weblate

source: It is recommended to run Weblate with a PostgreSQL database server.
sv: Det rekommenderas att kÃ¶ra Weblate med en PostgreSQL-databasserver.

source: PostgreSQL 13 and higher is supported. PostgreSQL 15 or newer is recommended.
sv: PostgreSQL 13 och hÃ¶gre stÃ¶ds. PostgreSQL 15 eller nyare rekommenderas.

source: :ref:`mysql` is supported, but not recommended for new installs.
sv: :ref:`mysql` stÃ¶ds, men rekommenderas inte fÃ¶r nya installationer.

source: The support for MySQL and MariaDB is being considered for removal. Please see https://github.com/WeblateOrg/weblate/issues/16140 for more info.
sv: StÃ¶det fÃ¶r MySQL och MariaDB Ã¶vervÃ¤gs att tas bort. Se https://github.com/WeblateOrg/weblate/issues/16140 fÃ¶r mer information.

source: No other database servers are currently supported, but support for other Django supported databases should be possible to implement.
sv: Inga andra databasservrar stÃ¶ds fÃ¶r nÃ¤rvarande, men stÃ¶d fÃ¶r andra Django-stÃ¶dda databaser bÃ¶r vara mÃ¶jligt att implementera.

source: Database connections
sv: Databasanslutningar

source: In the default configuration, each Weblate process keeps a persistent connection to the database. Persistent connections improve Weblate responsiveness, but might require more resources for the database server. Please consult :setting:`django:CONN_MAX_AGE` and :ref:`django:persistent-database-connections` for more info.
sv: I standardkonfigurationen upprÃ¤tthÃ¥ller varje Weblate-process en permanent anslutning till databasen. Permanenta anslutningar fÃ¶rbÃ¤ttrar Weblates responsivitet, men kan krÃ¤va mer resurser fÃ¶r databasservern. Se :setting:`django:CONN_MAX_AGE` och :ref:`django:persistent-database-connections` fÃ¶r mer information.

source: Weblate needs at least the following number of connections:
sv: Weblate behÃ¶ver minst fÃ¶ljande antal anslutningar:

# :math:`(4 imes mathit{nCPUs}) + 2` for Celery processes
source: :math:`(4 \times \mathit{nCPUs}) + 2` for Celery processes
sv: :math:`(4 \times \mathit{nCPUs}) + 2` fÃ¶r Celery-processer

source: :math:`\mathit{nCPUs} + 1` for WSGI workers
sv: :math:`\mathit{nCPUs} + 1` fÃ¶r WSGI-arbetare

source: This applies to Docker container defaults and example configurations provided in this documentation, but the numbers will change once you customize the amount of WSGI workers or adjust parallelism of Celery.
sv: Detta gÃ¤ller standardinstÃ¤llningarna fÃ¶r Docker-containrar och exempelkonfigurationerna i denna dokumentation, men siffrorna kommer att Ã¤ndras nÃ¤r du anpassar antalet WSGI-arbetare eller justerar parallelliteten i Celery.

source: The actual limit for the number of database connections needs to be higher to account following situations:
sv: Den faktiska grÃ¤nsen fÃ¶r antalet databasanslutningar mÃ¥ste vara hÃ¶gre fÃ¶r att ta hÃ¤nsyn till fÃ¶ljande situationer:

source: :ref:`manage` need their connection as well.
sv: :ref:`manage` behÃ¶ver ocksÃ¥ deras anslutning.

source: If case process is killed (for example by OOM killer), it might block the existing connection until timeout.
sv: Om processprocessen avbryts (till exempel av OOM-killer) kan den blockera den befintliga anslutningen tills tidsgrÃ¤nsen lÃ¶per ut.

source: PostgreSQL is usually the best choice for Django-based sites. It's the reference database used for implementing Django database layer.
sv: PostgreSQL Ã¤r vanligtvis det bÃ¤sta valet fÃ¶r Django-baserade webbplatser. Det Ã¤r referensdatabasen som anvÃ¤nds fÃ¶r att implementera Djangos databaslager.

source: Weblate uses trigram extension which has to be installed separately in some cases. Look for ``postgresql-contrib`` or a similarly named package.
sv: Weblate anvÃ¤nder trigram-tillÃ¤gg som i vissa fall mÃ¥ste installeras separat. Leta efter ``postgresql-contrib`` eller ett paket med liknande namn.

source: Creating a database in PostgreSQL
sv: Skapa en databas i PostgreSQL

source: It is usually a good idea to run Weblate in a separate database, and separate user account:
sv: Det Ã¤r vanligtvis en bra idÃ© att kÃ¶ra Weblate i en separat databas och med ett separat anvÃ¤ndarkonto:

source: If you don't want to make the Weblate user a superuser in PostgreSQL, you can omit that. In that case you will have to perform some of the migration steps manually as a PostgreSQL superuser in schema Weblate will use:
sv: Om du inte vill gÃ¶ra Weblate-anvÃ¤ndaren till superanvÃ¤ndare i PostgreSQL kan du utelÃ¤mna det. I sÃ¥ fall mÃ¥ste du utfÃ¶ra vissa migreringssteg manuellt som superanvÃ¤ndare i PostgreSQL i det schema som Weblate kommer att anvÃ¤nda:

source: Configuring Weblate to use PostgreSQL
sv: Konfigurera Weblate fÃ¶r att anvÃ¤nda PostgreSQL

source: The :file:`settings.py` snippet for PostgreSQL:
sv: :file:`settings.py`-snippet fÃ¶r PostgreSQL:
